Commands to Configure a Switch:

Switch>enable
Switch#configure terminal
Switch(config)#hostname [name here]
[name](config)#line con 0
[name](config-line)#password cisco
[name](config-line)#login
[name](config-line)#logging synchronous
[name](config-line)#line vty 0 15
[name](config-line)#password cisco
[name](config-line)#login
[name](config-line)#transport input ssh telnet
[name](config-line)#exit
[name](config-vlan)#int vlan 1
[name](config-if)# ip address 192.168.10.1 255.255.255.0

Other Commands:

exit – backs up one space
end – backs out of config
do show run – shows what you’ve done



12 OCT In Class Exercise

Part 2: Step 2
	Router>enable
	Router#configure terminal
	Router(config)#hostname router1
	router1(config)#no ip domain-lookup
	router1(config)#enable secret class
	router1(config)#line con 0
	router1(config-line)#password cisco
	router1(config-line)#login
	router1(config-line)#exit
	router1(config)#line vty 0 4
	router1(config-line)#password cisco
	router1(config-line)#login
	router1(config-line)#exit
	router1(config)#service password-encryption
	router1(config)#banner motd # Anauthorized access is 	prohibited #
	router1(config)#interface G0/0
	router1(config-if)#ip address 192.168.0.1 255.255.255.0
	router1(config-if)#no shut
	router1(config-if)#description # Connected to PC-B #
	router1(config-if)#exit
	router1(config)#interface G0/1
	router1(config-if)#ip address 192.168.1.1 255.255.255.0
	router1(config-if)#no shut
	router1(config-if)#description # Connected to Switch1 #
	router1(config-if)#exit
	router1(config)#exit
	router1#copy running-config startup-config
	router1#clock set 14:05:07 12 OCT 2018


Resetting Configurations:

	Switch>enable
	Switch#delete vlan.dat
	Switch#write erase
	Switch#reload
	
	Router>enable
	Router#write erase
	Router#reload

Semester 1 Practice Exam

Router 1
	Router>enable
	Router#configure terminal
	Router(config)#hostname R1
	R1(config)#no ip domain-lookup
	R1(config)#ip domain-name cisco-lab.com
	R1(config)#enable secret class
	R1(config)#line con 0
	R1(config-line)#password cisco
	R1(config-line)#login
	R1(config-line)#exit
	R1(config)#line vty 0 4
	R1(config-line)#password cisco
	R1(config-line)#login
	R1(config-line)#transport input ssh telnet
	R1(config)#username R1admin secret R1sshpass
	R1(config)#crypto key generate rsa modulus 1024
	R1(config)#banner MOTD # Unauthroized access is prohibited #
	R1(config)#service password-encryption
Switch 1
	Switch>enable
	Switch#configure terminal
	Switch(config)#hostname S1
	S1(config)#no ip domain-lookup
	S1(config)#ip domain-name cisco-lab.com
	S1(config)#enable secret class
	S1(config)#line con 0
	S1(config-line)#password cisco
	S1(config-line)#login
	S1(config-line)#exit
	S1(config)#line vty 0 4
	S1(config-line)#password cisco
	S1(config-line)#login
	S1(config-line)#exit
	S1(config)#banner MOTD # Unauthroized access is prohibited #
	S1(config)#service password-encryption
Switch 2
	Switch>enable
	Switch#configure terminal
	Switch(config)#hostname S2
	S2(config)#no ip domain-lookup
	S2(config)#ip domain-name cisco-lab.com
	S2(config)#enable secret class
	S2(config)#line con 0
	S2(config-line)#password cisco
	S2(config-line)#login
	S2(config-line)#exit
	S2(config)#line vty 0 4
	S2(config-line)#password cisco
	S2(config-line)#login
	S2(config-line)#exit
	S2(config)#banner MOTD # Unauthroized access is prohibited #
	S2(config)#service password-encryption
Layer 3 Router 1
	R1>en
	R1#configure terminal
	R1(config)#int G0/0
	R1(config-if)#ip address 172.19.9.254 255.255.248.0
	R1(config-if)#ipv6 address 2001:DB8:ACAD:BB:FFFF:FFFF:FFFF:FFFF/64
	R1(config-if)#ipv6 address FE80::1 link-local
	R1(config-if)#description # Subnet B #
	R1(config-if)#no shut
	R1(config-if)#exit
	R1(config)#int G0/1
	R1(config-if)#ip address 172.19.7.254 255.255.248.0
	R1(config-if)#ipv6 address 2001:DB8:ACAD:AA:FFFF:FFFF:FFFF:FFFF/64
	R1(config-if)#ipv6 address FE80::1 link-local
	R1(config-if)#description # Subnet A #
	R1(config-if)#no shut
	R1(config-if)#exit
	R1(config)#ipv6 unicast-routing
	R1#copy running-config startup-config
Layer 3 Switch 1
	S1#configure terminal
	S1(config)#int vlan 1
	S1(config-if)#ip address 172.19.7.253 255.255.248.0
	S1(config-if)#ipv6 address 2001:DB8:ACAD:AA:ffff:ffff:ffff:fffe/64
	S1(config-if)#no shut
	S1(config-if)#exit
	S1(config)#ipv6 route 2001:DB8:ACAD:AA:ffff:ffff:ffff:fffe/64 	2001:DB8:ACAD:AA:ffff:ffff:ffff:ffff
	S1(config)#ip default-gateway 172.19.7.254
Layer 3 Switch 2
	S1#configure terminal
	S1(config)#int vlan 1
	S1(config-if)#ip address 172.19.9.253 255.255.254.0
	S1(config-if)#ipv6 address 2001:DB8:ACAD:BB:ffff:ffff:ffff:fffe/64
	S1(config-if)#no shut
	S1(config-if)#exit
	S1(config)#ipv6 route 2001:DB8:ACAD:BB:ffff:ffff:ffff:fffe/64 					2001:DB8:ACAD:BB:ffff:ffff:ffff:ffff
	S1(config)#ip default-gateway 172.19.9.254